# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}


import math
# Вариант 1
# pi = math.pi
# d = int(input('Введите точность числа : '))
# print(round(pi,d))

# Вариант 2
d = float(input('Введите точность числа в формате 10^{-1} ≤ d ≤10^{-10}: '))
count = 0
if d <= (10 **(-1)) and d >= (10 ** (-10)):
    while (d != 1):
        d = d*10
        count += 1
    print (count)
    a = str(round(math.pi, count + 1))
    print(a)
    print (f'Число в заданном формате: {a[:(len(a)-1)]}')
else: print('Ошибка. Введите точность пи в формате 10^{-1} ≤ d ≤10^{-1}')

